

export default function ObjComparisonPage() {
  return (<></>
    // <div className="bg-gray-50 dark:bg-gray-900">
    //   <div className="max-w-[1300px] mx-auto px-4 sm:px-6 lg:px-8 py-12">
    //     <div className="text-center mb-12">
    //       <h1 className="text-3xl md:text-4xl font-bold text-gray-900 dark:text-white mb-3">
    //         对象比对工具
    //       </h1>
    //       <p className="text-base text-gray-500 dark:text-gray-400 max-w-2xl mx-auto">
    //         在线比对两个对象，快速查看差异
    //       </p>
    //     </div>
    //     这里写下面的内容。
    //     请实现以下功能：
    //     1.页面上写两个输入框，这两个输入框一样大，一左一右。这两个输入框均会显示代码行数，特殊字符会显示高亮。输入框长度由输入的内容长度决定，输入框可以横向滚动，查看代码完整内容的。
    //     2.两个输入框的代码数据始终位置是左右同步的。行数同步。
    //     3.输入到输入框的对象会自动格式化。自动比对对象的字段。并且会自动整理对象，让其字段位置显示一致。比如{a:1,b:2}，{b:2,a:1}都改为{a:1,b:2}显示。
    //     若不一致，则显示差异：字段一样，字段对应的数据不一致，则在两边输入框中黄色高亮标出字段所在的这一行或多行；若一边缺少字段，则在缺少的那边输入框空出这一行，并在另一边输入框红色高亮标出缺少的这一行或多行。
    //     做到左右输入框的数据始终位置是左右同步的。
    //     4.在两个输入框上方有个按钮“比较数据”，点击后就会进行上述的对象比较处理，处理完成后会显示比对结果。在处理过程中，按钮显示为“比较中...”，按钮背景颜色不停变换，像是在加载中一样，比较完成后按钮显示为“比较数据”。并且在处理过程中，按钮无法被再次点击。
    //     5.在按钮“比较数据”，旁边有一个“清空”按钮，点击后，先弹出对话提示框（请使用这个弹窗组件components\general\Modal），提示是否确认清空。点击确认后，两个输入框内容就会被清空。取消则关闭弹窗，无事发生。

    //     要求：
    //     1.代码简洁、逻辑清晰
    //     2.页面样式、配色参考其他页面，有深、浅色两种模式。配色主要以黑白为主。
    //     3.如果需要写组件，请将组件位置放在components\WebTool\ObjComparison下，组件名称请使用驼峰命名法。
    //     4.页面主要内容请写在当前页面中。

    //   </div>
    // </div>
  )
}
